---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotCreateDimensionNotParallel
source: html/f060dae1-2a77-130b-e1a4-8c873b11b0dc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotCreateDimensionNotParallel Property

Can't create dimension. Highlighted references are not parallel to first selection.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateDimensionNotParallel { get; }
```